![ESRC Logo](../logos/Economic_and_Social_Research_Council_logo.svg)

# Using Administrative Data to Understand UK Civil Society Organisations

We are an ESRC funded group of collaborators seeking to improve data infrastructure surrounding the UK’s third sector and civil society more generally. The grant is entitled “Improving Access to and Use of Organisation-Level Data on the Third Sector and Civil Society” (Project Reference: ES/X000524/1).

In this notebook we demonstrate how to use some of the data resources we constructed during the project. Feedback on these training materials, and the data resources more generally, is very welcome - you can find contact information at the end of this file.

## Civil Society Organisation Spine

The initial data resource of our project is a list or "spine" of all formally registered UK third sector and civil society organisations, their names, addresses and dates of registration (and dissolution where relevant). Additionally, where organisations are found in more than one register, we provide a file listing these linkages. Data relating to alternative organisation names and addresses is also collated.

### Construction of the Spine

For general information on how the spine was constructed, including which raw datasets were utilised, how datasets were linked through organisation ids and names and more, please see our short presentation: 
* [LINK AVAILABLE AFTER RECORDING]()

In addition our project website contains a number of blogs on conceptual and definitional issues when analysing UK civil society:
* [Motivations for mapping third sector organisations in the UK](https://uk-third-sector-database.github.io/_posts/2024/001/blog-post-2)
* [Building a foundational dataset of third sector organisations in the UK](https://uk-third-sector-database.github.io/_posts/2024/001/blog-post-3/)

### Downloading the Data

The latest versions of the dataset are found on the project webpage https://uk-third-sector-database.github.io/data/

For this lesson we download and unzip the data directly from the source above for use in this notebook - for your purposes you will likely download it to your machine first.

Our first task is to ensure we have the functionality we need to handling the data in Python (the programming language this notebook uses).

In [2]:
import pandas as pd
import os
import zipfile
from IPython.display import display

In [6]:
with zipfile.ZipFile(zip_path, 'r') as zf:
    zf.extractall(extract_dir)

print(f"Downloaded to {zip_path} and extracted to {extract_dir}")

FileNotFoundError: [Errno 2] No such file or directory: 'tso_spine_files.zip'

### Importing the Data

In [4]:
spine_df = pd.read_csv('tso_spine_files/public_spine.spine.csv')

C:\Users\diarm\AppData\Local\Temp\ipykernel_6540\2787623812.py:1: DtypeWarning: Columns (4,7) have mixed types. Specify dtype option on import or set low_memory=False.
  spine_df = pd.read_csv('tso_spine_files/public_spine.spine.csv')

In [28]:

print('The top 5 rows of the spine data are:')
display(spine_df.head())
print('\nThe summary statistics of the spine data are:')
display(spine_df.describe())
print(f'\nThe spine data has {spine_df.shape[0]} rows and {spine_df.shape[1]} columns.\n')
print(f'Spine data columns are: {list(spine_df.columns)}.\n')

The top 5 rows of the spine data are:

,uid,organisationname,normalisedname,fulladdress,city,postcode,registerdate,removeddate
0,GB-CHC-200009,THE RALPH LEVY CHARITABLE COMPANY LIMITED,THE RALPH LEVY CHARITABLE COMPANY LIMITED,"5-6 DOWN STREET, LONDON",NaN,W1J 7AH,17/03/1961,NaN
1,GB-CHC-200012,CHURCH AND POOR'S CHARITY,CHURCH AND POORS CHARITY,"62 HIGH STREET, WRESTLINGWORTH, SANDY, BEDFORD...",NaN,SG19 2EP,22/06/1961,NaN
2,GB-CHC-200017,THE SHOWERING FUND,THE SHOWERING FUND,"PATHOLOGY SCIENCES PHASE 2 LEVEL 2, NORTH BRIS...",NaN,BS10 5NB,08/06/1961,NaN
3,GB-CHC-200023,MOSSWOOD MISSION HALL (TRUST 1188),MOSSWOOD MISSION HALL TRUST 1188,"41 CUMBERLEDGE HILL, RUGELEY",NaN,WS15 4SB,22/06/1961,NaN
4,GB-CHC-200024,THE D'OYLY CARTE OPERA TRUST LIMITED,THE DOYLY CARTE OPERA TRUST LIMITED,"D'OYLY CARTE OPERA TRUST LTD, 1 NORTHUMBERLAND...",NaN,WC2N 5BW,07/02/1961,NaN

The summary statistics of the spine data are:

,uid,organisationname,normalisedname,fulladdress,city,postcode,registerdate,removeddate
count,804056,794620,794619,708272,315073,754841,759227,392767
unique,804056,759788,741561,556137,8628,373738,29801,13907
top,GB-CHC-200009,Deleted,DELETED,"-, -",LONDON,EC1A 9EJ,01/01/1992,02/06/2012
freq,1,1775,1775,9349,76259,15505,18679,19596

The spine data has 804056 rows and 8 columns.

Spine data columns are: ['uid', 'organisationname', 'normalisedname', 'fulladdress', 'city', 'postcode', 'registerdate', 'removeddate'].

2. Matches: this file contains the linkages we found between organisation on the spine, and registrations elsewhere for the same organisation. These can be due to registration within the same regulator, and across regulators.

In [29]:
matches_df = pd.read_csv('data/public_spine.matches.csv')

/var/folders/kx/my6qjd410pg_mks04z_5dm3r0000gn/T/ipykernel_93567/2978414177.py:1: DtypeWarning: Columns (1) have mixed types. Specify dtype option on import or set low_memory=False.
  matches_df = pd.read_csv('data/public_spine.matches.csv')

In [30]:
print(f'\nThe matches data has {matches_df.shape[0]} rows and {matches_df.shape[1]} columns.\n')
print(f'matches data columns are: {list(matches_df.columns)}.\n')
print('The top 5 rows of the matches data are:')
display(matches_df.head())
print('\nThe summary statistics of the matches data are:')
display(matches_df.describe())

The matches data has 112879 rows and 8 columns.

matches data columns are: ['uid', 'orgA_id_in_source', 'orgA_source', 'orgA_uid', 'orgB_id_in_source', 'orgB_source', 'orgB_uid', 'match_type'].

The top 5 rows of the matches data are:

,uid,orgA_id_in_source,orgA_source,orgA_uid,orgB_id_in_source,orgB_source,orgB_uid,match_type
0,GB-CHC-200009,200009,CCEW,GB-CHC-200009,00686799,CH,GB-COH-00686799,companyid - id_in_source
1,GB-CHC-200024,200024,CCEW,GB-CHC-200024,00682766,CH,GB-COH-00682766,companyid - id_in_source
2,GB-CHC-200048,200048,CCEW,GB-CHC-200048,00683275,CH,GB-COH-00683275,companyid - id_in_source
3,GB-CHC-200103,200103,CCEW,GB-CHC-200103,A2072,SocialHousingEngland,GB-SHPE-A2072,ftc
4,GB-CHC-200103,200103,CCEW,GB-CHC-200103,A2072,SocialHousingEngland,GB-SHPE-A2072,name - housing

The summary statistics of the matches data are:

,uid,orgA_id_in_source,orgA_source,orgA_uid,orgB_id_in_source,orgB_source,orgB_uid,match_type
count,111930,112879,112879,112879,112879,112879,112879,112879
unique,99143,99143,7,99144,102452,9,102621,7
top,GB-CHC-1066001,1201116,CCEW,GB-CHC-1201116,CS2003002877,CH,GB-SHPE-A2406,ftc
freq,679,854,73967,854,7,78101,7,63343

If a match is assured, using the rules described in the associated documents, then the 'uid' is the same as a row in the spine, for example uid GB-CHC-200009:

In [31]:
display(matches_df[matches_df['uid'] == 'GB-CHC-200009'])

,uid,orgA_id_in_source,orgA_source,orgA_uid,orgB_id_in_source,orgB_source,orgB_uid,match_type
0,GB-CHC-200009,200009,CCEW,GB-CHC-200009,00686799,CH,GB-COH-00686799,companyid - id_in_source

In [32]:
display(spine_df[spine_df['uid']=='GB-CHC-200009'])
display(spine_df[spine_df['uid']=='GB-COH-00686799'])

,uid,organisationname,normalisedname,fulladdress,city,postcode,registerdate,removeddate
0,GB-CHC-200009,THE RALPH LEVY CHARITABLE COMPANY LIMITED,THE RALPH LEVY CHARITABLE COMPANY LIMITED,"5-6 DOWN STREET, LONDON",NaN,W1J 7AH,17/03/1961,NaN

Empty DataFrame
Columns: [uid, organisationname, normalisedname, fulladdress, city, postcode, registerdate, removeddate]
Index: []

So 'The Ralph Levy Charitable Company Limited' is on the spine, but the matched organisation 'GB-COH-00686799' is not, since these have been found to be the same organisation. 

The 'match_type' field in public_spine.matches.csv shows how the match was determined; in this case 'companyid - id_in_source' comes from the Charity Commission register having a note of the associated record at Companies House.

3. Supplementary: A third csv completes the set. This contains extra name and address data about the organisations on the spine (or matched to the spine), for example a previous address or alternative name.

In [33]:
supplementary_df = pd.read_csv('data/public_spine.supplementary.csv')

In [23]:
print(f'\nThe supplementary data has {supplementary_df.shape[0]} rows and {supplementary_df.shape[1]} columns.\n')
print(f'supplementary data columns are: {list(supplementary_df.columns)}.\n')
print('The top 5 rows of the supplementary data are:')
display(supplementary_df.head())
print('\nThe summary statistics of the supplementary data are:')
display(supplementary_df.describe())

The supplementary data has 1163448 rows and 9 columns.

supplementary data columns are: ['uid', 'organisationname', 'normalisedname', 'fulladdress', 'city', 'postcode', 'registerdate', 'removeddate', 'source'].

The top 5 rows of the supplementary data are:

,uid,organisationname,normalisedname,fulladdress,city,postcode,registerdate,removeddate,source
0,GB-CHC-200009,NaN,NaN,"14 CHESTERFIELD STREET, LONDON",NaN,W1J 5JN,NaN,NaN,CCEW
1,GB-CHC-200009,NaN,NaN,"1 HINDE STREET, LONDON",NaN,W1U 2AY,NaN,NaN,CCEW
2,GB-CHC-200009,NaN,NaN,"116 PICCADILLY, LONDON",NaN,W1J 7BJ,NaN,NaN,CCEW
3,GB-COH-00686799,RALPH LEVY CHARITABLE COMPANY LIMITED(THE),RALPH LEVY CHARITABLE COMPANY LIMITED THE,"1 HINDE STREET, HINDE STREET",LONDON,W1U 2AY,NaN,NaN,CH
4,GB-COH-00686799,NaN,NaN,5-6 DOWN STREET,LONDON,NaN,NaN,NaN,CH

The summary statistics of the supplementary data are:

,uid,organisationname,normalisedname,fulladdress,city,postcode,registerdate,removeddate,source
count,1163448,324512,324505,546543,83936,480017,223998,48650,1163448
unique,517580,292929,286077,477537,4182,278255,14211,5976,10
top,GB-CHC-1052330,VILLAGE HALL,VILLAGE HALL,"MILESTONE HOUSE 18 NURSERY COURT, KIBWORTH HAR...",LONDON,SE1 7HR,31/12/2012,04/03/2022,CCEW
freq,452,368,368,888,16249,3867,16677,679,686137

Using the same example of the Ralph Levey Charitable Company, we find the following data in the supplementary csv for the organisation, from both the Charity Commission (CCEW) and Companies House (CH):

In [24]:
display(supplementary_df[supplementary_df['uid']=='GB-CHC-200009'])
display(supplementary_df[supplementary_df['uid']=='GB-COH-00686799'])

,uid,organisationname,normalisedname,fulladdress,city,postcode,registerdate,removeddate,source
0,GB-CHC-200009,NaN,NaN,"14 CHESTERFIELD STREET, LONDON",NaN,W1J 5JN,NaN,NaN,CCEW
1,GB-CHC-200009,NaN,NaN,"1 HINDE STREET, LONDON",NaN,W1U 2AY,NaN,NaN,CCEW
2,GB-CHC-200009,NaN,NaN,"116 PICCADILLY, LONDON",NaN,W1J 7BJ,NaN,NaN,CCEW
7,GB-CHC-200009,NaN,NaN,NaN,NaN,NaN,22/06/1961,NaN,CCEW

,uid,organisationname,normalisedname,fulladdress,city,postcode,registerdate,removeddate,source
3,GB-COH-00686799,RALPH LEVY CHARITABLE COMPANY LIMITED(THE),RALPH LEVY CHARITABLE COMPANY LIMITED THE,"1 HINDE STREET, HINDE STREET",LONDON,W1U 2AY,NaN,NaN,CH
4,GB-COH-00686799,NaN,NaN,5-6 DOWN STREET,LONDON,NaN,NaN,NaN,CH
5,GB-COH-00686799,NaN,NaN,NaN,NaN,W1J 7BJ,NaN,NaN,CH
6,GB-COH-00686799,NaN,NaN,NaN,NaN,NaN,31/12/1961,NaN,CH

These rows show four previous addresses for the organisation, and two alternative registration dates.